In [3]:
#import pandas
import pandas as pd

In [9]:
#to read data from different files.
#read csv --- pd.read_csv("")
jsonf = pd.read_json("Jay.json")

#.tail(): it is giving me the record from the last 
#last 10 record .tail(10)
#first 5 rows : .head()
jsonf.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [10]:
#to add new row in dataset(append)
new_row = {'Duration': 55, 'Pulse': 121, 'Maxpulse': 151, 'Calories': 423}
jsonf = jsonf.append(new_row, ignore_index=True)
jsonf.tail()

#what are thte other ways to add rows aprt from append()
# if I want to add multiple row at a time how can I do?

<ipython-input-10-d364468cb551>:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  jsonf = jsonf.append(new_row, ignore_index=True)

     Duration  Pulse  Maxpulse  Calories
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4
169        55    121       151     423.0

In [11]:
#to check data type of each column

jsonf.dtypes

Duration      int64
Pulse         int64
Maxpulse      int64
Calories    float64
dtype: object

In [12]:
#to find all the description about the dataset
#If the DataFrame contains numerical data, the description contains these information for each column:
#std - The standard deviation.
#min - the minimum value.
#25% - The 25% percentile*.
#50% - The 50% percentile*.
#75% - The 75% percentile*.
#max - the maximum value.
#count - The number of not-empty values.
#mean - The average (mean) value.

jsonf.describe()

         Duration       Pulse    Maxpulse     Calories
count  170.000000  170.000000  170.000000   165.000000
mean    63.794118  107.541176  134.147059   376.086061
std     42.180073   14.504480   16.453147   265.589187
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   251.000000
50%     60.000000  105.000000  131.000000   319.200000
75%     60.000000  111.000000  142.500000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

In [13]:
#give the information of the data 
jsonf.info

<bound method DataFrame.info of      Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4
169        55    121       151     423.0

[170 rows x 4 columns]>

In [16]:
# if you want to save you data in other file
#save data in csv file: .to_csv()
jsonf.to_json("Desktop\Jay2.json")
jsonf1=pd.read_json("Desktop\Jay2.json")
jsonf1

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4
169        55    121       151     423.0

[170 rows x 4 columns]

In [19]:
#dictionary data to dataframe using DataFrame() method 
#We can give the name of the rows using index
import pandas as pd

d={'Mouse':[150,200,300,400],
   'Keyboard':[180,200,190,300],
   'Scanner':[200,280,330,450]}

df=pd.DataFrame(d,index=['Jan','Feb','March','April'])

df

       Mouse  Keyboard  Scanner
Jan      150       180      200
Feb      200       200      280
March    300       190      330
April    400       300      450

In [21]:
#access the data using loc
# want data fro, Jan and April month and data only for Mouse coloumn
#df.loc[:,:]
df.loc[['Jan','April'],'Mouse']

Jan      150
April    400
Name: Mouse, dtype: int64

In [22]:
#access data for all the rows but any two column

df.loc[:,['Mouse','Scanner']]

       Mouse  Scanner
Jan      150      200
Feb      200      280
March    300      330
April    400      450

In [23]:
#A.	Write code to access data of Mouse and Scanner columns.

print(df['Mouse'])
print(df['Scanner'])

df[['Mouse','Scanner']]

Jan      150
Feb      200
March    300
April    400
Name: Mouse, dtype: int64
Jan      200
Feb      280
March    330
April    450
Name: Scanner, dtype: int64

       Mouse  Scanner
Jan      150      200
Feb      200      280
March    300      330
April    400      450

In [24]:
#B.	Write code to access data of the Keyboard column using dot notation and column name.

df.Keyboard

Jan      180
Feb      200
March    190
April    300
Name: Keyboard, dtype: int64

In [26]:
#Access data for Jan Row

df.loc[['Jan'],:]

     Mouse  Keyboard  Scanner
Jan    150       180      200

In [28]:
#C.	Write code to access data of scanners using loc[].

df.loc[:,['Scanner']]



df

       Mouse  Keyboard  Scanner
Jan      150       180      200
Feb      200       200      280
March    300       190      330
April    400       300      450

In [29]:
#To select a particular number of rows and columns, you can do the following using .iloc.
df.iloc[[0,2],[0,2]]

       Mouse  Scanner
Jan      150      200
March    300      330

In [30]:
#To select a single value from the DataFrame, you can do the following.
df.loc['Jan','Mouse']

150

In [31]:
df

       Mouse  Keyboard  Scanner
Jan      150       180      200
Feb      200       200      280
March    300       190      330
April    400       300      450

In [33]:
#D.	Write code to access data of all columns where mouse data is more than 200.
df[df['Keyboard']>180][['Mouse','Keyboard','Scanner']]

       Mouse  Keyboard  Scanner
Feb      200       200      280
March    300       190      330
April    400       300      450

In [34]:
#E.	Write code to access columns using 0 and 2.

df.iloc[:,[0,2]]

       Mouse  Scanner
Jan      150      200
Feb      200      280
March    300      330
April    400      450

In [35]:
#F.	Write code to access data of rows of jan and march for scanner and keyboard

df.loc[['Jan','March'],['Scanner','Keyboard']]

       Scanner  Keyboard
Jan        200       180
March      330       190

In [40]:
#Access a single value for a row/column pair by label.
df.at['Jan','Mouse']
df

       Mouse  Keyboard  Scanner
Jan      150       180      200
Feb      200       200      280
March    300       190      330
April    400       300      450

In [39]:
#Access a single value for a row/column pair by integer position.
df.iat[2,2]

330

In [41]:
#Add column
df['Monitor']=[200,300,400,500]

In [42]:
df

       Mouse  Keyboard  Scanner  Monitor
Jan      150       180      200      200
Feb      200       200      280      300
March    300       190      330      400
April    400       300      450      500

In [ ]:
#Add Row
# append()
df2 = {'Mouse': 200, 'Keyboard': 600, 'Scanner': 300}
df = df.append(df2, ignore_index = True)
df

In [ ]:
data=pd.read_csv("company_sales_data.csv")

In [ ]:
data.tail(10)

In [ ]:
data2=data.head()
data2

In [ ]:
data.dtypes

In [ ]:
data.describe()

In [ ]:
data.info
#The info() method prints information about the DataFrame.
#The information contains the number of columns, column labels, column data types, memory usage, range index,
#and the number of cells in each column (non-null values).

In [ ]:
data2.to_csv("C:\\Users\Geetu Sodhi\Downloads\HouseD.csv")

In [ ]:
#if you want to append data in existing csv file
data2.to_csv("C:\\Users\Geetu Sodhi\Downloads\HouseCourse7.csv", mode='a')